run/tutorials/case2_liquefaction/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//type probes;
// Fields to be probed. runTime modifiable!
fields
(
    pE
    tauXZ
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (1.59 0.0 -0.085)
    (1.59 0.0 -0.185)
    (1.59 0.0 -0.24)
    (1.59 0.0 -0.3)
    (1.59 0.0 -0.4)

);


// ************************************************************************* //
